@echo off
:: Включаем поддержку кириллицы в консоли (чтобы не было ошибок с кодировкой)
chcp 65001 >nul

echo ==========================================
echo Шаг 1: Установка зависимостей...
echo ==========================================
pip install -r requirements.txt

echo.
echo ==========================================


echo.
echo ==========================================
echo Шаг 3: Запуск GUI...
echo ==========================================
:: GUI запускаем в этом окне. Когда закроешь GUI, консоль закроется.
python gui.py

pause